ROMAJI_DICT = {
    'a': 'ア',
    'i': 'イ',
    'u': 'ウ',
    'e': 'エ',
    'o': 'オ',
    'N': 'ン',
    'cl': 'ッ',
    'pau': ' ',
    'sil': ' ',
    'br': ' ',
    'k': {
        'a': 'カ',
        'i': 'キ',
        'u': 'ク',
        'e': 'ケ',
        'o': 'コ',
    },
    's': {
        'a': 'サ',
        'i': 'スィ',
        'u': 'ス',
        'e': 'セ',
        'o': 'ソ',
    },
    't': {
        'a': 'タ',
        'i': 'チ',
        'u': 'トゥ',
        'e': 'テ',
        'o': 'ト',
    },
    'n': {
        'a': 'ナ',
        'i': 'ニ',
        'u': 'ヌ',
        'e': 'ネ',
        'o': 'ノ',
    },
    'h': {
        'a': 'ハ',
        'i': 'ヒ',
        'u': 'フ',
        'e': 'ヘ',
        'o': 'ホ',
    },
    'm': {
        'a': 'マ',
        'i': 'ミ',
        'u': 'ム',
        'e': 'メ',
        'o': 'モ',
    },
    'y': {
        'a': 'ヤ',
        'u': 'ユ',
        'e': 'イェ',
        'o': 'ヨ',
    },
    'r': {
        'a': 'ラ',
        'i': 'リ',
        'u': 'ル',
        'e': 'レ',
        'o': 'ロ',
    },
    'w': {
        'a': 'ワ',
        'i': 'ウィ',
        'e': 'ウェ',
        'o': 'ウォ',
    },
    'g': {
        'a': 'ガ',
        'i': 'ギ',
        'u': 'グ',
        'e': 'ゲ',
        'o': 'ゴ',
    },
    'z': {
        'a': 'ザ',
        'i': 'ズィ',
        'u': 'ズ',
        'e': 'ゼ',
        'o': 'ゾ',
    },
    'd': {
        'a': 'ダ',
        'i': 'ディ',
        'u': 'ドゥ',
        'e': 'デ',
        'o': 'ド',
    },
    'b': {
        'a': 'バ',
        'i': 'ビ',
        'u': 'ブ',
        'e': 'ベ',
        'o': 'ボ',
    },
    'p': {
        'a': 'パ',
        'i': 'ピ',
        'u': 'プ',
        'e': 'ペ',
        'o': 'ポ',
    },
    'ky': {
        'a': 'キャ',
        'u': 'キュ',
        'e': 'キェ',
        'o': 'キョ',
    },
    'sh': {
        'a': 'シャ',
        'i': 'シ',
        'u': 'シュ',
        'e': 'シェ',
        'o': 'ショ',
    },
    'ch': {
        'a': 'チャ',
        'i': 'チ',
        'u': 'チュ',
        'e': 'チェ',
        'o': 'チョ',
    },
    'ts': {
        'a': 'ツァ',
        'i': 'ツィ',
        'u': 'ツ',
        'e': 'ツェ',
        'o': 'ツォ',
    },
    'ny': {
        'a': 'ニャ',
        'u': 'ニュ',
        'e': 'ニェ',
        'o': 'ニョ',
    },
    'hy': {
        'a': 'ヒャ',
        'u': 'ヒュ',
        'e': 'ヒェ',
        'o': 'ヒョ',
    },
    'f': {
        'a': 'ファ',
        'i': 'フィ',
        'u': 'フ',
        'e': 'フェ',
        'o': 'フォ',
    },
    'my': {
        'a': 'ミャ',
        'u': 'ミュ',
        'e': 'ミェ',
        'o': 'ミョ',
    },
    'ry': {
        'a': 'リャ',
        'u': 'リュ',
        'e': 'リェ',
        'o': 'リョ',
    },
    'gy': {
        'a': 'ギャ',
        'u': 'ギュ',
        'e': 'ギェ',
        'o': 'ギョ',
    },
    'j': {
        'a': 'ジャ',
        'i': 'ジ',
        'u': 'ジュ',
        'e': 'ジェ',
        'o': 'ジョ',
    },
    'by': {
        'a': 'ビャ',
        'u': 'ビュ',
        'e': 'ビェ',
        'o': 'ビョ',
    },
    'py': {
        'a': 'ピャ',
        'u': 'ピュ',
        'e': 'ピェ',
        'o': 'ピョ',
    },
    'v': {
        'a': 'ヴァ',
        'i': 'ヴィ',
        'u': 'ヴ',
        'e': 'ヴェ',
        'o': 'ヴォ',
    },
}


def conv(lst: list) -> str:
    r = ''
    _sub_dct = None
    _sion = ''
    for s in lst:
        if _sub_dct is not None:
            if s in _sub_dct:
                r += _sub_dct[s]
                _sub_dct = None
                _sion = ''
                continue
            else:
                r += _sion
                _sub_dct = None
                _sion = ''
        if s in ROMAJI_DICT:
            if type(ROMAJI_DICT[s]) is str:
                r += ROMAJI_DICT[s]
            else:
                _sub_dct = ROMAJI_DICT[s]
                _sion = s
        else:
            r += s
    return r


if __name__ == '__main__':
    text = ['pau', 'k', 'o', 'br', 'a', 'z', 'br', 'u', 'cl', 'sh', 'i', 'ny', 'a']
    print(conv(text))
